Tekla Open API Reference for Tekla Structures 2025
GridCylindricalSurface Constructor
 Creates a new grid plane instance.
The default values are as follows:
CylinderBase = new Arc(new Point(0, 0, 0), new Point(6000, 0, 0), new Vector(0, 0, 1), Math.PI);
CylinderHeight = 6000.0;
Label = "Default";
IsMagnetic = false;
ExtensionLeft = 2000.0;
ExtensionRight = 2000.0;
ExtensionBelow = 2000.0;
ExtensionAbove = 2000.0;
DrawingVisibility = false;
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GridCylindricalSurface()
Public Sub New
See Also
Reference
GridCylindricalSurface Class
GridCylindricalSurface Overload
Tekla.Structures.Model Namespace